label_list = [
    '관계_없음',
    '이론:대체어',
    '이론:상위_이론',
    '이론:하위_이론',
    '이론:상위_학문분야',
    '학문분야:하위_이론',
    '인물:소속이론또는학문분야',
    '용어:치료기법',
    '용어:약',
    '용어:증상또는질환',
    '용어:대체어'
]

dict_label_to_num = {
    '관계_없음': 0,
    '이론:대체어': 1,
    '이론:상위_이론': 2,
    '이론:하위_이론': 3,
    '이론:상위_학문분야': 4,
    '학문분야:하위_이론': 5,
    '인물:소속이론또는학문분야': 6,
    '용어:치료기법': 7,
    '용어:약': 8,
    '용어:증상또는질환': 9,
    '용어:대체어': 10
}

dict_num_to_label = {
    0: '관계_없음',
    1: '이론:대체어',
    2: '이론:상위_이론',
    3: '이론:하위_이론',
    4: '이론:상위_학문분야',
    5: '학문분야:하위_이론',
    6: '인물:소속이론또는학문분야',
    7: '용어:치료기법',
    8: '용어:약',
    9: '용어:증상또는질환',
    10: '용어:대체어'
}

n_classes = len(label_list)